app/Services/CompteService.php

   public function getAllComptes($queryParams = [] )
   {
       $query = comptes::with(['transactions'])
            ->search($queryParams['search'] ?? null)
           ->sortAndOrder($queryParams['sort'] ?? null, $queryParams['order'] ?? null);

       return $query->paginate($queryParams['limit'] ?? 10, ['*'], 'page', $queryParams['page'] ?? 1);
---
select * from "transactions" where "transactions"."compte_id" in ('08e1af4f-0048-48da-9d87-2ebf38c16a4b', '2ef59ec2-cafa-4421-a329-3eda95561732', '3836cb98-489a-45b4-b308-9baa665c9e4a', 'b3a7fa47-ebb9-4133-8760-7902ad982d9d', 'ca02ab30-a4ff-494a-aeb1-12dfd67b3c93', 'cacd0bab-f764-495a-8fa9-80f04198c26a', 'cbb4f6de-f1f2-49fc-a151-5b1419d32a2a', 'cef4312a-acfa-4efe-967c-b0e25b81955a', 'd25c4b82-3bef-4bf9-8576-791cb2fc4dd2', 'd5868b0d-30a3-49ef-bfa0-5f6cc21c777e', 'daf71378-2fa2-4f8a-8952-df715a1bec02', 'eadca00a-99f6-4eef-beb4-9246f5c17a99')